-- phpMyAdmin SQL Dump
-- version 5.0.3
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Mar 22, 2021 at 05:09 AM
-- Server version: 10.4.14-MariaDB
-- PHP Version: 7.2.34

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `6239010023`
--

-- --------------------------------------------------------

--
-- Table structure for table `checkted`
--

CREATE TABLE `checkted` (
  `id` int(11) NOT NULL COMMENT 'เลขที่บันทึก',
  `rfidID` varchar(11) NOT NULL COMMENT 'เลขที่บัตรนักเรียน',
  `record` datetime NOT NULL DEFAULT current_timestamp() COMMENT 'วันเวลาที่บันทึก',
  `temp` varchar(200) NOT NULL COMMENT 'อุณหภูมิร่างกาย',
  `st_health` varchar(200) NOT NULL COMMENT 'สถานะร่างกาย',
  `st_hand` varchar(50) CHARACTER SET utf8 COLLATE utf8_thai_520_w2 NOT NULL COMMENT 'สถานะจ่ายเจล'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `checkted`
--

INSERT INTO `checkted` (`id`, `rfidID`, `record`, `temp`, `st_health`, `st_hand`) VALUES
(1, '596324341', '2021-02-28 22:43:19', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(2, '596324341', '2021-02-28 22:45:45', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(3, '596324341', '2021-02-28 23:01:07', '32', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(4, '596324341', '2021-02-28 23:01:13', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(5, '596324341', '2021-02-28 23:03:20', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(6, '596324341', '2021-02-28 23:04:30', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(7, '596324341', '2021-02-28 23:05:24', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(8, '596324341', '2021-02-28 23:14:11', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(9, '596324341', '2021-02-28 23:15:48', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(10, '596324341', '2021-02-28 23:15:52', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(11, '596324341', '2021-02-28 23:15:59', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(12, '596324341', '2021-02-28 23:16:03', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(13, '596324341', '2021-02-28 23:16:08', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(14, '596324341', '2021-02-28 23:16:13', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(15, '596324341', '2021-02-28 23:16:37', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(16, '596324341', '2021-02-28 23:16:41', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(17, '596324341', '2021-02-28 23:16:44', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(18, '596324341', '2021-02-28 23:16:48', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(19, '596324341', '2021-02-28 23:20:55', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(20, '596324341', '2021-02-28 23:21:01', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(21, '596324341', '2021-02-28 23:21:05', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(22, '596324341', '2021-02-28 23:21:11', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(23, '596324341', '2021-02-28 23:21:16', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(24, '596324341', '2021-02-28 23:21:21', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(25, '596324341', '2021-02-28 23:21:27', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(26, '596324341', '2021-02-28 23:21:37', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(27, '596324341', '2021-02-28 23:21:43', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(28, '596324341', '2021-02-28 23:21:46', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(29, '596324341', '2021-02-28 23:21:50', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(30, '596324341', '2021-02-28 23:21:53', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(31, '596324341', '2021-02-28 23:21:56', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(32, '596324341', '2021-02-28 23:22:24', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(33, '596324341', '2021-02-28 23:22:27', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(34, '596324341', '2021-02-28 23:22:30', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(35, '596324341', '2021-02-28 23:22:34', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(36, '596324341', '2021-02-28 23:22:38', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(37, '596324341', '2021-02-28 23:22:41', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(38, '596324341', '2021-02-28 23:22:44', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(39, '596324341', '2021-02-28 23:22:47', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(40, '596324341', '2021-02-28 23:22:51', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(41, '596324341', '2021-02-28 23:22:54', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(42, '596324341', '2021-02-28 23:22:57', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(43, '596324341', '2021-02-28 23:23:01', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(44, '596324341', '2021-02-28 23:23:04', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(45, '596324341', '2021-02-28 23:23:07', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(46, '596324341', '2021-02-28 23:23:11', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(47, '596324341', '2021-02-28 23:23:14', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(48, '596324341', '2021-02-28 23:23:17', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(49, '596324341', '2021-02-28 23:23:20', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(50, '596324341', '2021-02-28 23:23:24', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(51, '596324341', '2021-02-28 23:23:27', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(52, '596324341', '2021-02-28 23:23:33', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(53, '596324341', '2021-02-28 23:23:37', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(54, '596324341', '2021-02-28 23:23:40', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(55, '596324341', '2021-02-28 23:23:44', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(56, '596324341', '2021-02-28 23:23:48', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(57, '596324341', '2021-02-28 23:23:52', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(58, '596324341', '2021-02-28 23:23:55', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(59, '596324341', '2021-02-28 23:23:59', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(60, '596324341', '2021-02-28 23:24:02', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(61, '596324341', '2021-02-28 23:24:05', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(62, '596324341', '2021-02-28 23:24:09', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(63, '596324341', '2021-02-28 23:24:25', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(64, '596324341', '2021-02-28 23:24:28', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(65, '596324341', '2021-02-28 23:24:32', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(66, '596324341', '2021-02-28 23:24:36', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(67, '596324341', '2021-02-28 23:24:39', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(68, '596324341', '2021-02-28 23:24:43', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(69, '596324341', '2021-02-28 23:24:46', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(70, '596324341', '2021-02-28 23:24:49', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(71, '596324341', '2021-02-28 23:24:53', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(72, '596324341', '2021-02-28 23:25:07', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(73, '596324341', '2021-02-28 23:25:34', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(74, '596324341', '2021-02-28 23:25:37', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(75, '596324341', '2021-02-28 23:25:41', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(76, '596324341', '2021-02-28 23:25:44', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(77, '596324341', '2021-02-28 23:25:47', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(78, '596324341', '2021-02-28 23:25:51', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(79, '596324341', '2021-02-28 23:25:54', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(80, '596324341', '2021-02-28 23:25:58', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(81, '596324341', '2021-02-28 23:26:02', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(82, '596324341', '2021-02-28 23:26:05', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(83, '596324341', '2021-02-28 23:26:15', '32', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(84, '596324341', '2021-02-28 23:26:32', '1037', 'มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(85, '596324341', '2021-02-28 23:26:40', '32', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(86, '596324341', '2021-02-28 23:26:45', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(87, '596324341', '2021-02-28 23:42:52', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(88, '596324341', '2021-02-28 23:44:26', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(89, '596324341', '2021-02-28 23:47:00', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(90, '596324341', '2021-02-28 23:47:37', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(91, '596324341', '2021-02-28 23:51:15', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(92, '596324341', '2021-03-01 00:02:10', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(93, '596324341', '2021-03-01 00:02:57', '33', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(94, '596324341', '2021-03-01 00:03:25', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(95, '596324341', '2021-03-01 00:03:54', '32', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(96, '596324341', '2021-03-01 00:04:38', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(97, '596324341', '2021-03-01 00:05:00', '62', 'มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(98, '596324341', '2021-03-01 00:05:18', '46', 'มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(99, '596324341', '2021-03-01 00:05:58', '52', 'มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(100, '596324341', '2021-03-01 00:20:27', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(101, '596324341', '2021-03-01 00:21:13', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(102, '596324341', '2021-03-01 00:21:41', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(103, '596324341', '2021-03-01 00:22:10', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(104, '596324341', '2021-03-01 00:22:35', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(105, '596324341', '2021-03-01 00:22:40', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(106, '596324341', '2021-03-01 00:22:44', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(107, '596324341', '2021-03-01 00:22:52', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(108, '596324341', '2021-03-01 00:22:56', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(109, '596324341', '2021-03-01 00:23:00', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(110, '596324341', '2021-03-01 00:23:04', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(111, '596324341', '2021-03-01 00:24:38', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(112, '596324341', '2021-03-01 00:24:44', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(113, '596324341', '2021-03-01 00:25:33', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(114, '596324341', '2021-03-01 00:25:38', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(115, '596324341', '2021-03-01 00:25:42', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(116, '596324341', '2021-03-01 00:25:46', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(117, '596324341', '2021-03-01 00:25:51', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(118, '596324341', '2021-03-01 00:25:55', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(119, '596324341', '2021-03-01 00:25:59', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(120, '596324341', '2021-03-01 00:26:02', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(121, '596324341', '2021-03-01 00:26:05', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(122, '596324341', '2021-03-01 00:26:11', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(123, '596324341', '2021-03-01 00:32:24', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(124, '596324341', '2021-03-01 00:34:29', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(125, '596324341', '2021-03-01 00:43:59', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(126, '21414275231', '2021-03-01 22:09:03', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(127, '21414275231', '2021-03-01 22:10:12', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(128, '21414275231', '2021-03-02 23:21:10', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(129, '21414275231', '2021-03-02 23:21:43', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(130, '21414275231', '2021-03-02 23:21:50', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(131, '21414275231', '2021-03-02 23:22:00', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(132, '21414275231', '2021-03-02 23:22:07', '31', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(133, '21414275231', '2021-03-02 23:23:45', '30', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(134, '21414275231', '2021-03-02 23:23:52', '32', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(135, '21414275231', '2021-03-02 23:23:56', '32', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(136, '21414275231', '2021-03-02 23:25:02', '34', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(137, '21414275231', '2021-03-02 23:25:36', '29', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(138, '21414275231', '2021-03-02 23:27:46', '-273', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(139, '21414275231', '2021-03-02 23:27:56', '-273', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(140, '21414275231', '2021-03-02 23:28:30', '-273', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(141, '21414275231', '2021-03-02 23:28:37', '-273', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(142, '21414275231', '2021-03-02 23:30:34', '-273', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(143, '21414275231', '2021-03-02 23:30:39', '-273', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(144, '21414275231', '2021-03-02 23:38:14', '-273', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(145, '21414275231', '2021-03-02 23:40:06', '1037', 'มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(146, '21414275231', '2021-03-02 23:40:11', '1037', 'มีความเสี่ยง', 'จ่ายเจลแล้ว'),
(147, '21414275231', '2021-03-02 23:40:30', '-273', 'ไม่มีความเสี่ยง', 'จ่ายเจลแล้ว');

-- --------------------------------------------------------

--
-- Table structure for table `stations`
--

CREATE TABLE `stations` (
  `id` int(11) NOT NULL COMMENT 'เลขที่บันทึก',
  `station_name` varchar(100) NOT NULL COMMENT 'ชื่อสถานีจ่ายเจล',
  `time_updated` datetime NOT NULL DEFAULT current_timestamp() COMMENT 'เวลาอัพเดทข้อมูล',
  `count` int(11) NOT NULL COMMENT 'จำนวนคน'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `stations`
--

INSERT INTO `stations` (`id`, `station_name`, `time_updated`, `count`) VALUES
(1, 'Bangna1', '2021-01-06 18:03:21', 0);

-- --------------------------------------------------------

--
-- Table structure for table `student`
--

CREATE TABLE `student` (
  `rfidID` varchar(11) NOT NULL COMMENT 'เลขที่บัตรนักเรียน',
  `studentID` varchar(10) NOT NULL COMMENT 'เลขประจำนักศึกษา',
  `programID` int(2) NOT NULL COMMENT 'เลขที่สาขาวิชา',
  `prefix` enum('นาย','นาง','นางสาว','') CHARACTER SET utf8mb4 COLLATE utf8mb4_thai_520_w2 NOT NULL COMMENT 'คำนำหน้าชื่อ',
  `fullname` varchar(255) NOT NULL COMMENT 'ชื่อ-นามสกุล',
  `Nickname` varchar(50) NOT NULL COMMENT 'ชื่อ (ภาษาอังกฤษ)',
  `picture` varchar(255) NOT NULL COMMENT 'ชื่อรูปภาพรูปภาพ',
  `Tempreture` decimal(10,2) NOT NULL COMMENT 'วัดอุณหภูมิ'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `student`
--

INSERT INTO `student` (`rfidID`, `studentID`, `programID`, `prefix`, `fullname`, `Nickname`, `picture`, `Tempreture`) VALUES
('2122242362', '6239010005', 4, 'นาย', 'ปริญญา ดอนประดู่', 'Parinya', '6239010005.jpg', '27.00'),
('596324341', '6239010023', 4, 'นาย', 'อธิวัฒน์ เจริญฐิติธนชัย', 'Athwat', '6239010023.jpg', '29.00');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `checkted`
--
ALTER TABLE `checkted`
  ADD PRIMARY KEY (`id`),
  ADD KEY `rfidID` (`rfidID`);

--
-- Indexes for table `stations`
--
ALTER TABLE `stations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `student`
--
ALTER TABLE `student`
  ADD PRIMARY KEY (`rfidID`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `checkted`
--
ALTER TABLE `checkted`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'เลขที่บันทึก', AUTO_INCREMENT=148;

--
-- AUTO_INCREMENT for table `stations`
--
ALTER TABLE `stations`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'เลขที่บันทึก', AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
